app/Modules/MediaClips/Controllers/Administrator.php

    public function add()
    {
        $data = [];
        helper(['form']);

        $model = new MediaClips_m();
        $media = new MediaHouses_m();

        if ($this->request->getPost()) {
            $post = (object) $this->request->getPost();
            $mediahouse = (object) $media->find($post->mediahouse);
---
SELECT *
FROM `mediahouses`
WHERE `mediahouses`.`id` = '31'