app/Modules/MediaClips/Models/MediaClips_m.php

SELECT *
FROM `clips`
WHERE `clipid` = '14'
---
    function media_clips($id) {
        $list = $this->db->table('clips')->where('clipid',$id)->get()->getResult();

SELECT *
FROM `mediaclips`
ORDER BY `id` DESC
---
    function all_clips() {
        $list = $this->db->table('mediaclips')->orderBy('id','DESC')->get()->getResult();