app/Modules/MediaHouses/Models/MediaHouses_m.php

SELECT *
FROM `mediahouses`
ORDER BY `name` ASC
---
    function get_all_media()
    {
        return $this->db->table('mediahouses')->orderBy('name','ASC')->get()->getResult();