app/Modules/Users/Models/Users_m.php

   function get_admin_users() {
    $admins = $this->db
                    ->table('users')
                    ->select('users.*, auth_identities.secret,auth_groups_users.group')
                    ->join('auth_identities', 'auth_identities.user_id = users.id', 'left')
                    ->join('auth_groups_users', 'auth_groups_users.user_id = users.id', 'left')
                    ->where('users.id !=',auth()->user()->id)
                    ->orderBy('users.id', 'DESC')
                    ->get()
                    ->getResult();
---
SELECT `users`.*, `auth_identities`.`secret`, `auth_groups_users`.`group`
FROM `users`
LEFT JOIN `auth_identities` ON `auth_identities`.`user_id` = `users`.`id`
LEFT JOIN `auth_groups_users` ON `auth_groups_users`.`user_id` = `users`.`id`
WHERE `users`.`id` != 4
ORDER BY `users`.`id` DESC