app/Modules/Industries/Controllers/Administrator.php

    function updateIndustry($id)
    {
        $model = new Industries_m();


        $rw = (object) $model->find($id);



        if ($this->request->getPost()) {

            $post =  (object) $this->request->getPost();

            $validation = \Config\Services::validation();
            $validation->setRules([
                'name' => 'required|is_unique[industries.name,id,' . $id . ']',
                'status' => 'required'
            ]);

            if ($validation->withRequest($this->request)->run()) {
                // Update data
                $rw->name = $post->name;
                $rw->status = $post->status;
                $rw->updated_at = time();
                $rw->modified_by =  auth()->user()->id;


                if ($model->save($rw))
---
UPDATE `industries` SET `name` = 'Production', `description` = 'Production industry', `status` = '1', `created_by` = '7', `updated_at` = 1724034024, `modified_by` = 7
WHERE `industries`.`id` IN ('1')