app/Modules/Industries/Models/Industries_m.php

    function get_all_industries()
    {
        return $this->db->table('industries')->orderBy('name', 'ASC')->get()->getResult();
---
SELECT *
FROM `industries`
ORDER BY `name` ASC