app/Modules/Permissions/Controllers/Administrator.php

    public function index()
    {
        $data = [];
        helper(['form']);
        $model = new Groups_m();

        $data['groups'] = $model->findAll();
---
SELECT *
FROM `groups`