app/Modules/Groups/Controllers/Administrator.php

            }
        }

        $data['groups'] = $model->findAll();
---
SELECT *
FROM `groups`