app/Modules/Settings/Models/Settings_m.php

SELECT *
FROM `system`
WHERE `id` = 1
---
    function find_set($id) {
        return $this->db->table('system')->where('id',$id)->get()->getRow();