app/Modules/Slots/Models/Slots_m.php

    function get_all_slots()
    {
        return $this->db->table('slots')->orderBy('name', 'ASC')->get()->getResult();
---
SELECT *
FROM `slots`
ORDER BY `name` ASC