app/Models/GeneralModel.php

    function user_group($id) {
        return $this->db->table('auth_groups_users')->where('user_id', $id)->get()->getRow();
---
SELECT *
FROM `auth_groups_users`
WHERE `user_id` = 7

    function user_permissions($id) {
        $list = $this->db->table('auth_permissions_users')->where('user_id',$id)->get()->getResult();
---
SELECT *
FROM `auth_permissions_users`
WHERE `user_id` = 7