app/Modules/Groups/Models/Groups_m.php

    function get_group_permissions($id) {
        $list = $this->db->table('group_permissions')->where('group_id',$id)->get()->getResult();
---
SELECT *
FROM `group_permissions`
WHERE `group_id` = '3'